

const questions = [
  {
    title: 'Вопрос №1: React - это ... ?',
    variants: ['Библиотека', 'Фреймворк', 'Приложение'],
    correct: 0,
  },
  {
    title: 'Вопрос №2: Компонент - это ... ?',
    variants: [
      'Приложение',
      'Мы не знаем что это такое, если бы мы знали что это такое, мы не занем что это такое',
      'Самодостаточные элементы, которые можно использовать на странице любое количество раз'
    ],
    correct: 2,
  },
  {
    title: 'Вопрос №3: Что такое JSX?',
    variants: [
      'Расширение синтаксиса для JavaScript, позволяющее писать HTML-подобную разметку внутри файла JavaScript',
      'JavaScriptXMens',
      'Мы не знаем что это такое, если бы мы знали что это такое, мы не занем что это такое'],
    correct: 0,
  },
]

export default questions;